app/views/users/index.html.erb

	<ol id="highscores">
		<% Game.order(score: :desc).limit(20).each do |g| %>
---
SELECT  "games".* FROM "games"   ORDER BY "games"."score" DESC LIMIT 20