app/views/users/show.html.erb

SELECT "games".* FROM "games"  WHERE "games"."user_id" = $1  [["user_id", 5]]
---
			<ol id="highscores">
				<% current_user.games.each do |g| %>

SELECT "saved_questions".* FROM "saved_questions"  WHERE (user_id = 5)
---
			<ul>
				<% SavedQuestion.where("user_id = ?", current_user.id).each do |sq| %>