app/controllers/games_controller.rb

	def create
		puts "********inside games controller create********"
		g = Game.create(
			user_id: current_user.id,
			score: params[:score],
			category: params[:category],
		)
---
INSERT INTO "games" ("category", "created_at", "score", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "invention"], ["created_at", "2015-01-04 22:57:02.122078"], ["score", 500], ["updated_at", "2015-01-04 22:57:02.122078"], ["user_id", 5]]

	def saveQuestion
		sq = SavedQuestion.create(
			user_id: current_user.id,
			question: params[:question],
			answer: params[:answer]
		)
---
INSERT INTO "saved_questions" ("answer", "created_at", "question", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"