app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		@user_id = session[:current_user_id]
		if @user.save
---
INSERT INTO "users" ("avatar", "birthday", "chomper", "created_at", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def update
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def destroy
		@user = User.find(params[:id])
		if @user != current_user
			redirect_to users_path
		else
			@user.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]